{"1500": 1, "1501": 3, "1505": 1, "1555": 1, "1588": 1, "1600": 2, "1603": 1, "1614": 1, "1625": 1, "1629": 1, "1632": 2, "1637": 1, "1641": 2, "1642": 1, "1644": 16, "1646": 2, "1647": 1, "1648": 10, "1649": 1, "1650": 2, "1651": 3, "1653": 2, "1654": 3, "1655": 1, "1657": 2, "1658": 1, "1660": 1, "1661": 1, "1662": 1, "1667": 1, "1670": 1, "1671": 1, "1673": 3, "1674": 1, "1675": 4, "1676": 3, "1679": 1, "1680": 2, "1681": 5, "1683": 2, "1684": 4, "1685": 2, "1687": 2, "1688": 4, "1689": 3, "1690": 1, "1691": 3, "1692": 1, "1694": 3, "1695": 1, "1699": 6, "1700": 13, "1701": 4, "1702": 3, "1703": 5, "1704": 6, "1705": 6, "1706": 5, "1707": 3, "1708": 6, "1709": 3, "1710": 3, "1711": 7, "1712": 1, "1713": 2, "1714": 10, "1715": 15, "1716": 10, "1717": 3, "1718": 3, "1719": 3, "1720": 3, "1721": 5, "1722": 1, "1723": 6, "1724": 5, "1725": 5, "1726": 8, "1727": 2, "1728": 5, "1729": 14, "1730": 6, "1731": 10, "1732": 18, "1733": 2, "1734": 5, "1735": 8, "1736": 5, "1737": 9, "1738": 3, "1739": 16, "1740": 3, "1741": 10, "1742": 8, "1743": 4, "1744": 5, "1745": 5, "1746": 8, "1747": 12, "1748": 10, "1749": 9, "1750": 9, "1751": 13, "1752": 6, "1753": 13, "1754": 6, "1755": 14, "1756": 8, "1757": 15, "1758": 12, "1759": 20, "1760": 31, "1761": 17, "1762": 20, "1763": 30, "1764": 31, "1765": 25, "1766": 26, "1767": 35, "1768": 18, "1769": 23, "1770": 30, "1771": 27, "1772": 26, "1773": 22, "1774": 39, "1775": 21, "1776": 24, "1777": 61, "1778": 22, "1779": 30, "1780": 28, "1781": 29, "1782": 42, "1783": 57, "1784": 40, "1785": 81, "1786": 29, "1787": 65, "1788": 83, "1789": 103, "1790": 103, "1791": 97, "1792": 106, "1793": 105, "1794": 112, "1795": 92, "1796": 170, "1797": 86, "1798": 126, "1799": 142, "1800": 285, "1801": 220, "1802": 240, "1803": 310, "1804": 281, "1805": 258, "1806": 376, "1807": 449, "1808": 492, "1809": 463, "1810": 542, "1811": 604, "1812": 564, "1813": 493, "1814": 706, "1815": 735, "1816": 669, "1817": 816, "1818": 570, "1819": 680, "1820": 840, "1821": 800, "1822": 931, "1823": 846, "1824": 981, "1825": 1274, "1826": 973, "1827": 1013, "1828": 1236, "1829": 1213, "1830": 1376, "1831": 1456, "1832": 3004, "1833": 1794, "1834": 1654, "1835": 2147, "1836": 2228, "1837": 1747, "1838": 1742, "1839": 2083, "1840": 1966, "1841": 2352, "1842": 1895, "1843": 1996, "1844": 2451, "1845": 2552, "1846": 2579, "1847": 2038, "1848": 2383, "1849": 2254, "1850": 2748, "1851": 2761, "1852": 2959, "1853": 3495, "1854": 3427, "1855": 3114, "1856": 3206, "1857": 2903, "1858": 2899, "1859": 2621, "1860": 3160, "1861": 2965, "1862": 2495, "1863": 2204, "1864": 2855, "1865": 2658, "1866": 3230, "1867": 3102, "1868": 3341, "1869": 3266, "1870": 2973, "1871": 2823, "1872": 3064, "1873": 3095, "1874": 3119, "1875": 3269, "1876": 3148, "1877": 3069, "1878": 3123, "1879": 3131, "1880": 3337, "1881": 3677, "1882": 3333, "1883": 3817, "1884": 3535, "1885": 3735, "1886": 3357, "1887": 3729, "1888": 4005, "1889": 3904, "1890": 4183, "1891": 4269, "1892": 4398, "1893": 4272, "1894": 4456, "1895": 4566, "1896": 4947, "1897": 5183, "1898": 5461, "1899": 6189, "1900": 6361, "1901": 6138, "1902": 5832, "1903": 6429, "1904": 7678, "1905": 6515, "1906": 7356, "1907": 7059, "1908": 6824, "1909": 6583, "1910": 7148, "1911": 7412, "1912": 7328, "1913": 7409, "1914": 7235, "1915": 6943, "1916": 6362, "1917": 6797, "1918": 6833, "1919": 7682, "1920": 7376, "1921": 6944, "1922": 7453, "1923": 4636, "1924": 3860, "1925": 4433, "1926": 4525, "1927": 4771, "1928": 4964, "1929": 5047, "1930": 4733, "1931": 5415, "1932": 4749, "1933": 4866, "1934": 5399, "1935": 5642, "1936": 6347, "1937": 6480, "1938": 6482, "1939": 7450, "1940": 6609, "1941": 7099, "1942": 6010, "1943": 5855, "1944": 4870, "1945": 5507, "1946": 6802, "1947": 7463, "1948": 7924, "1949": 8756, "1950": 8513, "1951": 7660, "1952": 7681, "1953": 8143, "1954": 8537, "1955": 9291, "1956": 8862, "1957": 9557, "1958": 9738, "1959": 10539, "1960": 11342, "1961": 12868, "1962": 11967, "1963": 13417, "1964": 12033, "1965": 15057, "1966": 14491, "1967": 16079, "1968": 16884, "1969": 17007, "1970": 16639, "1971": 17114, "1972": 15824, "1973": 15772, "1974": 14383, "1975": 15847, "1976": 15546, "1977": 16369, "1978": 16068, "1979": 15926, "1980": 15699, "1981": 15785, "1982": 15781, "1983": 17221, "1984": 16007, "1985": 16786, "1986": 17442, "1987": 17899, "1988": 19307, "1989": 19018, "1990": 20528, "1991": 19964, "1992": 21157, "1993": 20011, "1994": 20298, "1995": 21618, "1996": 21731, "1997": 22136, "1998": 22751, "1999": 23537, "2000": 25635, "2001": 25768, "2002": 27099, "2003": 27070, "2004": 27862, "2005": 25361, "2006": 27714, "2007": 28487, "2008": 29007, "2009": 28094, "2010": 25364, "2011": 26079, "2012": 30851, "2013": 33460, "2014": 31183, "2015": 26929, "2016": 26788, "2017": 26946, "2018": 26377, "2019": 21185}