{"1480": 2, "1500": 1, "1501": 10, "1508": 2, "1539": 1, "1582": 1, "1585": 1, "1588": 1, "1592": 1, "1593": 1, "1596": 2, "1597": 1, "1603": 4, "1607": 1, "1609": 3, "1614": 1, "1621": 1, "1623": 1, "1630": 1, "1631": 5, "1632": 1, "1633": 3, "1634": 3, "1636": 2, "1637": 3, "1638": 5, "1639": 1, "1641": 6, "1642": 1, "1643": 1, "1644": 3, "1645": 6, "1646": 5, "1647": 3, "1648": 31, "1649": 2, "1650": 1, "1651": 6, "1652": 1, "1653": 1, "1654": 5, "1655": 9, "1657": 5, "1658": 4, "1659": 4, "1660": 7, "1661": 3, "1662": 2, "1663": 2, "1665": 3, "1666": 2, "1667": 4, "1668": 1, "1669": 2, "1670": 1, "1671": 8, "1672": 8, "1674": 4, "1675": 13, "1676": 9, "1677": 8, "1678": 4, "1679": 2, "1680": 4, "1681": 8, "1682": 7, "1683": 8, "1684": 11, "1685": 14, "1686": 5, "1687": 3, "1688": 5, "1689": 5, "1690": 5, "1691": 4, "1692": 13, "1693": 4, "1694": 5, "1695": 6, "1696": 5, "1697": 5, "1698": 11, "1699": 11, "1700": 40, "1701": 24, "1702": 11, "1703": 10, "1704": 8, "1705": 9, "1706": 10, "1707": 9, "1708": 16, "1709": 23, "1710": 8, "1711": 9, "1712": 12, "1713": 16, "1714": 20, "1715": 34, "1716": 26, "1717": 17, "1718": 11, "1719": 12, "1720": 30, "1721": 16, "1722": 13, "1723": 13, "1724": 20, "1725": 18, "1726": 26, "1727": 22, "1728": 27, "1729": 28, "1730": 13, "1731": 18, "1732": 41, "1733": 11, "1734": 18, "1735": 21, "1736": 24, "1737": 22, "1738": 19, "1739": 16, "1740": 22, "1741": 30, "1742": 35, "1743": 24, "1744": 35, "1745": 25, "1746": 10, "1747": 40, "1748": 26, "1749": 14, "1750": 52, "1751": 54, "1752": 58, "1753": 40, "1754": 42, "1755": 30, "1756": 27, "1757": 39, "1758": 42, "1759": 25, "1760": 66, "1761": 80, "1762": 78, "1763": 59, "1764": 81, "1765": 77, "1766": 48, "1767": 67, "1768": 66, "1769": 30, "1770": 53, "1771": 48, "1772": 76, "1773": 68, "1774": 50, "1775": 67, "1776": 35, "1777": 67, "1778": 68, "1779": 104, "1780": 59, "1781": 64, "1782": 72, "1783": 115, "1784": 82, "1785": 146, "1786": 94, "1787": 161, "1788": 143, "1789": 190, "1790": 192, "1791": 217, "1792": 234, "1793": 203, "1794": 192, "1795": 188, "1796": 198, "1797": 185, "1798": 173, "1799": 256, "1800": 428, "1801": 308, "1802": 438, "1803": 527, "1804": 544, "1805": 384, "1806": 584, "1807": 685, "1808": 756, "1809": 564, "1810": 1032, "1811": 1047, "1812": 960, "1813": 725, "1814": 943, "1815": 1076, "1816": 1012, "1817": 954, "1818": 972, "1819": 1145, "1820": 1158, "1821": 1261, "1822": 1441, "1823": 1497, "1824": 1649, "1825": 2047, "1826": 1741, "1827": 1707, "1828": 1703, "1829": 1671, "1830": 1839, "1831": 2090, "1832": 5332, "1833": 2739, "1834": 2403, "1835": 2877, "1836": 2815, "1837": 2682, "1838": 2308, "1839": 3177, "1840": 2732, "1841": 2895, "1842": 2205, "1843": 2432, "1844": 3078, "1845": 3672, "1846": 3421, "1847": 3199, "1848": 3322, "1849": 3115, "1850": 3743, "1851": 4497, "1852": 3867, "1853": 4556, "1854": 4824, "1855": 4469, "1856": 4194, "1857": 3900, "1858": 3906, "1859": 3892, "1860": 4222, "1861": 3794, "1862": 3448, "1863": 3881, "1864": 3913, "1865": 3657, "1866": 4608, "1867": 4566, "1868": 4813, "1869": 4848, "1870": 4975, "1871": 4352, "1872": 4746, "1873": 4680, "1874": 4551, "1875": 4735, "1876": 4784, "1877": 5078, "1878": 4791, "1879": 4446, "1880": 5552, "1881": 5214, "1882": 5437, "1883": 5790, "1884": 6455, "1885": 6042, "1886": 6624, "1887": 6024, "1888": 6781, "1889": 6988, "1890": 7095, "1891": 7064, "1892": 7071, "1893": 7344, "1894": 7411, "1895": 8392, "1896": 8487, "1897": 8790, "1898": 8589, "1899": 10700, "1900": 10331, "1901": 11471, "1902": 10460, "1903": 9939, "1904": 10984, "1905": 11684, "1906": 12803, "1907": 12405, "1908": 10789, "1909": 11406, "1910": 12539, "1911": 13675, "1912": 12297, "1913": 12350, "1914": 12203, "1915": 12019, "1916": 10461, "1917": 11313, "1918": 10321, "1919": 11647, "1920": 12848, "1921": 13150, "1922": 15058, "1923": 7773, "1924": 6220, "1925": 8029, "1926": 7246, "1927": 7926, "1928": 7679, "1929": 8104, "1930": 8128, "1931": 10212, "1932": 8147, "1933": 7443, "1934": 7733, "1935": 8938, "1936": 11785, "1937": 9429, "1938": 10526, "1939": 10492, "1940": 10220, "1941": 11369, "1942": 9746, "1943": 8905, "1944": 8252, "1945": 9691, "1946": 11999, "1947": 13274, "1948": 14102, "1949": 13605, "1950": 14772, "1951": 13207, "1952": 14700, "1953": 15589, "1954": 18947, "1955": 16252, "1956": 15352, "1957": 17561, "1958": 16301, "1959": 18177, "1960": 19477, "1961": 22994, "1962": 21290, "1963": 22563, "1964": 19401, "1965": 23216, "1966": 24134, "1967": 27089, "1968": 28502, "1969": 27264, "1970": 28577, "1971": 26943, "1972": 27435, "1973": 26311, "1974": 25872, "1975": 28071, "1976": 32070, "1977": 31432, "1978": 33897, "1979": 30804, "1980": 29536, "1981": 30929, "1982": 31934, "1983": 33680, "1984": 33120, "1985": 33779, "1986": 34654, "1987": 36250, "1988": 37275, "1989": 39263, "1990": 38337, "1991": 39825, "1992": 41457, "1993": 40657, "1994": 39663, "1995": 43190, "1996": 41543, "1997": 42041, "1998": 44394, "1999": 45192, "2000": 45804, "2001": 48776, "2002": 49635, "2003": 47917, "2004": 47756, "2005": 43396, "2006": 47600, "2007": 46136, "2008": 46777, "2009": 41440, "2010": 34212, "2011": 31172, "2012": 35529, "2013": 36531, "2014": 32789, "2015": 29229, "2016": 28683, "2017": 27420, "2018": 29186, "2019": 24562}