{"1501": 2, "1505": 2, "1508": 1, "1551": 1, "1578": 1, "1582": 1, "1609": 2, "1624": 1, "1627": 2, "1636": 5, "1641": 2, "1644": 2, "1645": 1, "1647": 1, "1652": 1, "1653": 1, "1654": 2, "1658": 3, "1661": 1, "1662": 3, "1666": 2, "1668": 1, "1669": 1, "1670": 4, "1671": 2, "1673": 1, "1674": 1, "1675": 2, "1676": 1, "1678": 3, "1680": 2, "1681": 1, "1682": 1, "1684": 3, "1685": 2, "1686": 1, "1687": 1, "1688": 6, "1689": 2, "1690": 2, "1691": 1, "1692": 2, "1693": 20, "1695": 2, "1696": 2, "1697": 2, "1698": 11, "1699": 1, "1700": 2, "1701": 1, "1702": 1, "1703": 3, "1705": 2, "1706": 6, "1708": 2, "1709": 2, "1710": 4, "1711": 1, "1712": 1, "1713": 1, "1714": 5, "1715": 9, "1716": 1, "1717": 11, "1718": 1, "1719": 2, "1720": 5, "1721": 4, "1722": 3, "1724": 7, "1725": 20, "1726": 6, "1727": 7, "1728": 12, "1729": 11, "1730": 15, "1731": 5, "1732": 2, "1734": 11, "1735": 5, "1736": 9, "1737": 3, "1738": 3, "1739": 3, "1740": 5, "1741": 43, "1742": 9, "1743": 3, "1744": 13, "1745": 7, "1746": 7, "1748": 1, "1749": 1, "1750": 10, "1751": 7, "1752": 15, "1753": 21, "1754": 2, "1755": 27, "1756": 8, "1757": 16, "1758": 11, "1759": 13, "1760": 7, "1761": 39, "1762": 18, "1763": 13, "1764": 73, "1765": 45, "1766": 13, "1767": 10, "1768": 21, "1769": 17, "1770": 9, "1771": 28, "1772": 30, "1773": 8, "1774": 7, "1775": 27, "1776": 16, "1777": 19, "1778": 18, "1779": 4, "1780": 3, "1781": 6, "1782": 27, "1783": 42, "1784": 44, "1785": 18, "1786": 7, "1787": 54, "1788": 51, "1789": 25, "1790": 42, "1791": 65, "1792": 82, "1793": 140, "1794": 50, "1795": 51, "1796": 49, "1797": 63, "1798": 44, "1799": 53, "1800": 68, "1801": 82, "1802": 92, "1803": 233, "1804": 171, "1805": 51, "1806": 138, "1807": 135, "1808": 130, "1809": 169, "1810": 194, "1811": 658, "1812": 236, "1813": 249, "1814": 223, "1815": 261, "1816": 220, "1817": 235, "1818": 260, "1819": 321, "1820": 208, "1821": 185, "1822": 357, "1823": 386, "1824": 623, "1825": 397, "1826": 558, "1827": 429, "1828": 615, "1829": 421, "1830": 453, "1831": 532, "1832": 1776, "1833": 689, "1834": 560, "1835": 625, "1836": 631, "1837": 793, "1838": 701, "1839": 774, "1840": 701, "1841": 633, "1842": 701, "1843": 695, "1844": 643, "1845": 956, "1846": 1030, "1847": 944, "1848": 865, "1849": 1104, "1850": 990, "1851": 1291, "1852": 1137, "1853": 1399, "1854": 1413, "1855": 1486, "1856": 1530, "1857": 1174, "1858": 1074, "1859": 1259, "1860": 1213, "1861": 1371, "1862": 903, "1863": 1433, "1864": 1101, "1865": 1321, "1866": 1183, "1867": 1793, "1868": 1832, "1869": 1770, "1870": 1870, "1871": 1621, "1872": 1791, "1873": 1979, "1874": 1724, "1875": 1709, "1876": 1635, "1877": 1875, "1878": 1605, "1879": 1801, "1880": 1753, "1881": 1818, "1882": 2072, "1883": 2397, "1884": 2938, "1885": 2414, "1886": 3016, "1887": 2784, "1888": 3127, "1889": 3179, "1890": 3345, "1891": 3214, "1892": 3154, "1893": 2805, "1894": 3039, "1895": 3862, "1896": 3395, "1897": 4239, "1898": 4216, "1899": 4165, "1900": 4286, "1901": 5324, "1902": 5486, "1903": 5645, "1904": 5720, "1905": 6756, "1906": 8140, "1907": 7921, "1908": 7432, "1909": 7486, "1910": 9461, "1911": 10115, "1912": 11376, "1913": 10372, "1914": 10931, "1915": 10310, "1916": 9385, "1917": 9312, "1918": 8273, "1919": 8522, "1920": 8309, "1921": 7880, "1922": 8564, "1923": 4485, "1924": 4077, "1925": 5046, "1926": 4855, "1927": 4056, "1928": 4558, "1929": 5158, "1930": 5367, "1931": 5314, "1932": 4972, "1933": 4608, "1934": 3951, "1935": 4681, "1936": 5647, "1937": 5076, "1938": 5174, "1939": 6618, "1940": 5531, "1941": 5723, "1942": 4785, "1943": 4424, "1944": 3495, "1945": 4838, "1946": 5387, "1947": 6249, "1948": 5541, "1949": 5780, "1950": 6045, "1951": 5855, "1952": 6235, "1953": 6562, "1954": 7306, "1955": 7205, "1956": 6998, "1957": 7103, "1958": 5840, "1959": 7363, "1960": 6675, "1961": 9004, "1962": 7690, "1963": 8216, "1964": 6191, "1965": 7245, "1966": 7329, "1967": 8767, "1968": 8802, "1969": 7191, "1970": 7887, "1971": 8448, "1972": 8655, "1973": 8965, "1974": 8385, "1975": 8508, "1976": 9817, "1977": 11270, "1978": 11143, "1979": 10686, "1980": 8897, "1981": 10442, "1982": 11426, "1983": 11872, "1984": 10750, "1985": 9385, "1986": 9573, "1987": 11251, "1988": 12895, "1989": 10953, "1990": 12214, "1991": 12937, "1992": 14572, "1993": 12438, "1994": 11795, "1995": 13625, "1996": 12906, "1997": 14100, "1998": 15414, "1999": 16105, "2000": 15731, "2001": 17132, "2002": 17495, "2003": 16701, "2004": 19163, "2005": 14257, "2006": 17064, "2007": 14640, "2008": 15220, "2009": 12466, "2010": 8806, "2011": 6856, "2012": 9095, "2013": 8046, "2014": 7694, "2015": 6852, "2016": 7031, "2017": 6415, "2018": 6594, "2019": 6546}