{"1555": 1, "1563": 2, "1611": 1, "1629": 1, "1675": 1, "1677": 1, "1684": 2, "1693": 1, "1709": 1, "1717": 1, "1728": 1, "1737": 2, "1743": 1, "1747": 3, "1749": 3, "1750": 1, "1751": 2, "1753": 3, "1755": 1, "1758": 5, "1759": 10, "1760": 11, "1761": 1, "1762": 9, "1763": 13, "1764": 13, "1765": 2, "1766": 2, "1767": 2, "1768": 28, "1769": 5, "1770": 1, "1771": 2, "1772": 6, "1773": 20, "1774": 18, "1775": 12, "1776": 4, "1777": 12, "1778": 22, "1779": 12, "1780": 7, "1781": 3, "1782": 12, "1783": 4, "1784": 30, "1785": 11, "1786": 18, "1787": 18, "1788": 35, "1789": 14, "1790": 25, "1791": 6, "1792": 18, "1793": 16, "1794": 12, "1795": 13, "1796": 17, "1797": 31, "1798": 33, "1799": 54, "1800": 53, "1801": 83, "1802": 93, "1803": 77, "1804": 61, "1805": 58, "1806": 78, "1807": 117, "1808": 99, "1809": 151, "1810": 99, "1811": 141, "1812": 179, "1813": 112, "1814": 189, "1815": 165, "1816": 178, "1817": 234, "1818": 260, "1819": 211, "1820": 288, "1821": 171, "1822": 188, "1823": 281, "1824": 402, "1825": 316, "1826": 551, "1827": 575, "1828": 441, "1829": 539, "1830": 541, "1831": 240, "1832": 394, "1833": 470, "1834": 508, "1835": 487, "1836": 974, "1837": 966, "1838": 564, "1839": 485, "1840": 413, "1841": 721, "1842": 478, "1843": 589, "1844": 1181, "1845": 1123, "1846": 1355, "1847": 1146, "1848": 1927, "1849": 1079, "1850": 910, "1851": 1055, "1852": 1015, "1853": 1286, "1854": 1912, "1855": 1771, "1856": 1685, "1857": 1241, "1858": 1310, "1859": 1343, "1860": 2057, "1861": 893, "1862": 1533, "1863": 1289, "1864": 870, "1865": 981, "1866": 1006, "1867": 1101, "1868": 1155, "1869": 1372, "1870": 1320, "1871": 1722, "1872": 1210, "1873": 1757, "1874": 2020, "1875": 1870, "1876": 1792, "1877": 2208, "1878": 1654, "1879": 1448, "1880": 2114, "1881": 1630, "1882": 1753, "1883": 1923, "1884": 2215, "1885": 2361, "1886": 2355, "1887": 2687, "1888": 2426, "1889": 2564, "1890": 2381, "1891": 4398, "1892": 2773, "1893": 3186, "1894": 2575, "1895": 2531, "1896": 2367, "1897": 2079, "1898": 2716, "1899": 2558, "1900": 3208, "1901": 2595, "1902": 2994, "1903": 2967, "1904": 3471, "1905": 2914, "1906": 3431, "1907": 4216, "1908": 3395, "1909": 2658, "1910": 3586, "1911": 4213, "1912": 3867, "1913": 4007, "1914": 3652, "1915": 3516, "1916": 3988, "1917": 4469, "1918": 3659, "1919": 3538, "1920": 3707, "1921": 3164, "1922": 3538, "1923": 2432, "1924": 2086, "1925": 2641, "1926": 3394, "1927": 2776, "1928": 3021, "1929": 3211, "1930": 3083, "1931": 3028, "1932": 2836, "1933": 2590, "1934": 3040, "1935": 2840, "1936": 3013, "1937": 3529, "1938": 3880, "1939": 3724, "1940": 3620, "1941": 3647, "1942": 2823, "1943": 2574, "1944": 3091, "1945": 2886, "1946": 3379, "1947": 3478, "1948": 3567, "1949": 3933, "1950": 4115, "1951": 3666, "1952": 3512, "1953": 4146, "1954": 3949, "1955": 4812, "1956": 4537, "1957": 4806, "1958": 4487, "1959": 5397, "1960": 5379, "1961": 6450, "1962": 6627, "1963": 8469, "1964": 7303, "1965": 7621, "1966": 8612, "1967": 9490, "1968": 9563, "1969": 8585, "1970": 10974, "1971": 9452, "1972": 8021, "1973": 7905, "1974": 7790, "1975": 7160, "1976": 8177, "1977": 8251, "1978": 9011, "1979": 8411, "1980": 9342, "1981": 8678, "1982": 9973, "1983": 9971, "1984": 9451, "1985": 10180, "1986": 10287, "1987": 11002, "1988": 10101, "1989": 10525, "1990": 12062, "1991": 11185, "1992": 11844, "1993": 13085, "1994": 13343, "1995": 13557, "1996": 14183, "1997": 14349, "1998": 14844, "1999": 14746, "2000": 17178, "2001": 17285, "2002": 21850, "2003": 22576, "2004": 22465, "2005": 21465, "2006": 24193, "2007": 22492, "2008": 24067, "2009": 22065, "2010": 21189, "2011": 21632, "2012": 24631, "2013": 28491, "2014": 22773, "2015": 20753, "2016": 21926, "2017": 20984, "2018": 17821, "2019": 15739}