{"1520": 1, "1525": 1, "1535": 1, "1545": 1, "1555": 3, "1561": 2, "1563": 1, "1567": 2, "1582": 2, "1586": 1, "1589": 2, "1596": 1, "1599": 1, "1601": 1, "1604": 4, "1605": 7, "1611": 4, "1616": 9, "1623": 1, "1634": 2, "1635": 4, "1641": 2, "1645": 4, "1647": 6, "1653": 2, "1654": 1, "1655": 3, "1657": 1, "1661": 1, "1662": 4, "1665": 1, "1666": 2, "1669": 1, "1671": 1, "1675": 4, "1677": 4, "1680": 2, "1683": 1, "1684": 1, "1688": 2, "1689": 1, "1693": 2, "1696": 5, "1699": 1, "1700": 20, "1701": 1, "1706": 1, "1707": 2, "1708": 6, "1713": 2, "1717": 4, "1721": 1, "1724": 1, "1725": 1, "1726": 3, "1727": 4, "1728": 6, "1729": 2, "1730": 4, "1731": 13, "1733": 6, "1734": 3, "1736": 2, "1740": 1, "1741": 1, "1742": 2, "1746": 3, "1747": 35, "1748": 3, "1749": 2, "1750": 4, "1751": 4, "1752": 4, "1753": 17, "1754": 21, "1755": 45, "1756": 9, "1757": 6, "1758": 9, "1759": 11, "1760": 65, "1761": 11, "1762": 4, "1763": 21, "1764": 25, "1765": 32, "1766": 24, "1767": 31, "1768": 70, "1769": 11, "1770": 14, "1771": 19, "1772": 40, "1773": 53, "1774": 73, "1775": 45, "1776": 45, "1777": 60, "1778": 41, "1779": 38, "1780": 37, "1781": 47, "1782": 48, "1783": 44, "1784": 82, "1785": 75, "1786": 82, "1787": 72, "1788": 83, "1789": 69, "1790": 123, "1791": 101, "1792": 191, "1793": 137, "1794": 188, "1795": 111, "1796": 152, "1797": 322, "1798": 215, "1799": 487, "1800": 403, "1801": 379, "1802": 317, "1803": 457, "1804": 420, "1805": 462, "1806": 578, "1807": 862, "1808": 808, "1809": 866, "1810": 926, "1811": 926, "1812": 803, "1813": 855, "1814": 990, "1815": 956, "1816": 962, "1817": 1289, "1818": 1438, "1819": 1434, "1820": 1472, "1821": 1441, "1822": 1334, "1823": 1598, "1824": 1881, "1825": 1738, "1826": 1812, "1827": 2237, "1828": 2370, "1829": 2509, "1830": 2794, "1831": 2323, "1832": 2877, "1833": 2871, "1834": 3219, "1835": 3954, "1836": 4068, "1837": 4304, "1838": 3682, "1839": 3805, "1840": 3245, "1841": 3737, "1842": 3590, "1843": 3522, "1844": 4518, "1845": 4430, "1846": 4697, "1847": 5041, "1848": 6005, "1849": 4589, "1850": 5871, "1851": 5604, "1852": 5778, "1853": 5815, "1854": 7039, "1855": 6223, "1856": 6665, "1857": 5925, "1858": 6047, "1859": 6846, "1860": 9292, "1861": 5904, "1862": 7878, "1863": 7442, "1864": 5600, "1865": 6041, "1866": 6385, "1867": 7730, "1868": 7481, "1869": 7838, "1870": 8218, "1871": 8523, "1872": 8599, "1873": 9761, "1874": 9862, "1875": 10065, "1876": 10539, "1877": 9750, "1878": 9664, "1879": 9898, "1880": 12016, "1881": 11416, "1882": 11572, "1883": 12315, "1884": 12589, "1885": 14408, "1886": 14617, "1887": 16965, "1888": 16384, "1889": 17468, "1890": 19265, "1891": 23095, "1892": 21296, "1893": 20349, "1894": 19464, "1895": 22471, "1896": 21507, "1897": 21904, "1898": 24095, "1899": 25438, "1900": 30714, "1901": 28141, "1902": 28737, "1903": 28474, "1904": 31568, "1905": 27817, "1906": 30886, "1907": 33113, "1908": 32294, "1909": 32409, "1910": 36395, "1911": 37451, "1912": 35299, "1913": 37209, "1914": 34600, "1915": 34053, "1916": 39183, "1917": 37183, "1918": 37570, "1919": 37692, "1920": 39102, "1921": 36802, "1922": 40055, "1923": 28134, "1924": 24187, "1925": 28916, "1926": 33609, "1927": 33791, "1928": 35287, "1929": 38398, "1930": 36262, "1931": 36552, "1932": 32692, "1933": 30508, "1934": 34217, "1935": 37107, "1936": 38976, "1937": 40455, "1938": 43108, "1939": 43771, "1940": 42540, "1941": 40573, "1942": 34572, "1943": 32091, "1944": 31360, "1945": 33159, "1946": 40370, "1947": 44725, "1948": 45128, "1949": 50207, "1950": 51412, "1951": 50116, "1952": 45009, "1953": 53411, "1954": 53614, "1955": 61310, "1956": 60601, "1957": 65993, "1958": 66262, "1959": 70501, "1960": 80802, "1961": 89881, "1962": 93162, "1963": 107527, "1964": 102986, "1965": 109140, "1966": 121165, "1967": 126559, "1968": 128046, "1969": 121440, "1970": 128177, "1971": 123895, "1972": 122370, "1973": 119548, "1974": 116208, "1975": 114002, "1976": 122681, "1977": 120923, "1978": 132985, "1979": 123588, "1980": 134557, "1981": 132635, "1982": 147947, "1983": 148609, "1984": 142646, "1985": 150488, "1986": 156392, "1987": 159428, "1988": 156781, "1989": 169889, "1990": 175775, "1991": 166927, "1992": 177562, "1993": 178554, "1994": 183874, "1995": 184172, "1996": 203538, "1997": 205986, "1998": 211673, "1999": 213977, "2000": 249537, "2001": 239062, "2002": 280747, "2003": 282073, "2004": 300844, "2005": 300190, "2006": 294822, "2007": 313074, "2008": 325980, "2009": 310315, "2010": 304612, "2011": 295457, "2012": 347756, "2013": 406629, "2014": 348282, "2015": 310621, "2016": 298838, "2017": 290427, "2018": 245931, "2019": 232249}